app/controllers/products_controller.rb

    def show
      begin
        @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]